# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print('Введите первое число: ')
a = int(input())
b = int(input('ВВедите второе число: '))
c = int(input('Введите третье число; '))

print(f'{a + b + c} ({a} + {b} + {c})')